HRE_nozzle_wedge_20Bar/0/T.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298;

boundaryField
{
    inlet
    {
	    type		waveTransmissive;
		field		T;
		phi        	phi;
		rho        	rho;
		psi         psi;
		fieldInf	3297;
		gamma 		1.1724;
		lInf		0.0025;
		value		uniform 3297;	
    }

    outlet-1
    {
	    type		waveTransmissive;
		field		T;
		phi        	phi;
		rho        	rho;
		psi         psi;
		fieldInf	298;
		gamma 		1.1724; //1.1724
		lInf		0.01;
		value		uniform 298;	
    }
	
	outlet-2
    {
	    type		waveTransmissive;
		field		T;
		phi        	phi;
		rho        	rho;
		psi         psi;
		fieldInf	298;
		gamma 		1.1724; //1.1724
		lInf		0.01;
		value		uniform 298;		
    }
    wedge1
    {
        type		wedge;
    }
	wedge2
    {
        type		wedge;
    }
    nozzle
    {
        type		zeroGradient;
    }
    defaultFaces
    {
        type		empty;
    }
}

// ************************************************************************* //
