HRE_nozzle_wedge_20Bar/0/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
	    type		waveTransmissive;
		field		U;
		phi        	phi;
		rho        	rho;
		psi         psi;
		fieldInf	(0 0 0);
		gamma 		1.1724;
		lInf		1;
		value		uniform (0 0 0);
    }

    outlet-1
    {
	    type		waveTransmissive;
		field		U;
		phi        	phi;
		rho        	rho;
		psi         psi;
		fieldInf	(0 0 0);
		gamma 		1.1724;
		lInf		1;
		value		uniform (0 0 0);	
    }
	
	outlet-2
    {
	    type		waveTransmissive;
		field		U;
		phi        	phi;
		rho        	rho;
		psi         psi;
		fieldInf	(0 0 0);
		gamma 		1.1724;
		lInf		1;
		value		uniform (0 0 0);	
    }
    wedge1
    {
        type		wedge;
    }
    wedge2
    {
        type		wedge;
    }
    nozzle
    {
        type		noSlip;
    }
    defaultFaces
    {
        type		empty;
    }

}

// ************************************************************************* //
