HRE_nozzle_wedge_20Bar/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication checkMesh
runApplication decomposePar
runParallel $(getApplication)
runApplication reconstructPar 
>nozzle.foam


#------------------------------------------------------------------------------
