HRE_nozzle_wedge_20Bar/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       sutherland;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight       21.25; //20.84
    }
    thermodynamics
    {
        Cp              7300; //7300
        Hf              -1141000;
    }
    transport
    {
        //As              1.458e-06;
        //Ts              110.4;
		As          	10.699e-05;  
		Ts          	116;
        Pr              0.44; //0.44
    }
}


// ************************************************************************* //
