HRE_nozzle_wedge_20Bar/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
(-0.11012036868591751  0  0) //0
(-0.11012036868591751 0.036902303696783274 0.0008052111310999445) //1
(-0.06091729709020649 0.036902303696783274 0.0008052111310999445) //2
(0.05590734346564631 0.022301554935315326 0.0004866216597832111) //3
(0.05590734346564631 0  0) //4
(-0.06091729709020649 0  0) //5
 
(-0.11012036868591751 0.036902303696783274 -0.0008052111310999445) //6
(-0.06091729709020649 0.036902303696783274 -0.0008052111310999445) //7
(0.05590734346564631 0.022301554935315326 -0.0004866216597832111) //8
(0.5  0.022301554935315326 0.0004866216597832111) //9 
(0.5  0 0) //10 
(0.05590734346564631  0.22485368207302298 0.004906324796459481) //11 
(0.5  0.22485368207302298 0.004906324796459481) //12 
(0.5  0.022301554935315326 -0.0004866216597832111) //13 
(0.05590734346564631  0.22485368207302298 -0.004906324796459481 ) //14 
(0.5  0.22485368207302298  -0.004906324796459481) //15 
);

blocks
(
    hex (0 6 1 0 5 7 2 5) (60 1 10) simpleGrading (0.1 1 0.1) //block 0 
    hex (5 7 2 5 4 8 3 4) (60 1 100) simpleGrading (0.1 1 0.2) //block 1 
    hex (4 8 3 4 10 13 9 10) (60 1 100) simpleGrading (0.1 1 25) //block 2 
    hex (3 11 12 9 8 14 15 13) (48 100 1) simpleGrading (50 25 1) //block 3 
);

edges
(
polyLine 2 3 
 ( 
(-0.06091729709020649 0.036902303696783274 0.0008052111310999445)
(-0.060318257357722095 0.036899689876274906 0.0008051540973335615)
(-0.0597192632444326 0.036891848613802354 0.0008049830003777549)
(-0.05912036036605885 0.036878780506508106 0.0008046978532622198)
(-0.05852159433137375 0.03686048654957914 0.0008042986777020134)
(-0.05792301073872909 0.03683696813617109 0.0008037855040959001)
(-0.057324655172582936 0.03680822705730221 0.0008031583715240368)
(-0.056726573200028295 0.03677426550171691 0.0008024173277449965)
(-0.05612881036732293 0.03673508605571916 0.0008015624291921328)
(-0.0555314121964209 0.036690691702975446 0.0008005937409692799)
(-0.054934424181505834 0.03664108582428761 0.0007995113368457963)
(-0.05433789178552639 0.03658627219733538 0.0007983152992509472)
(-0.05374186043673411 0.03652625499638865 0.0007970057192676255)
(-0.053146375525223825 0.03646103879198965 0.0007955826966254173)
(-0.05255148239947706 0.03639062855060484 0.0007940463396930064)
(-0.05195722636290856 0.036315029634246716 0.0007923967654699218)
(-0.05136365267041626 0.036234247800065435 0.0007906340995776267)
(-0.05077080652493497 0.03614828919991043 0.0007887584762499531)
(-0.05017873307399397 0.03605716037986192 0.0007867700383228797)
(-0.049587477406278835 0.03596086827973236 0.0007846689372236529)
(-0.04899708454819782 0.03585942023253797 0.0007824553329592559)
(-0.04840759946045285 0.035752823963940354 0.0007801293941042244)
(-0.04781906703461566 0.03564108759165804 0.0007776912977878068)
(-0.04723153208970905 0.035524219624848384 0.0007751412296804775)
(-0.04664503936879383 0.03540222896345955 0.0007724793839797957)
(-0.04605963353556139 0.0352751248975527 0.0007697059633956174)
(-0.045475359170932414 0.03514291710659454 0.0007668211791346575)
(-0.044892260769661886 0.03500561565872023 0.0007638252508844064)
(-0.044310382736950614 0.03486323100996661 0.0007607184067964001)
(-0.043729769385063635 0.03471577400347594 0.0007575008834688438)
(-0.04315046492995561 0.034563255868670185 0.0007541729259285968)
(-0.04257251348790369 0.03440568822039578 0.0007507347876125098)
(-0.041995959072147794 0.03424308305803921 0.0007471867303481272)
(-0.04142084558953891 0.034075452764613136 0.0007435290243337465)
(-0.04084721683719539 0.03390281010581341 0.0007397619481178423)
(-0.04027511649916761 0.03372516822904691 0.000735885788577853)
(-0.039704588143111286 0.03354254066243031 0.0007319008408983343)
(-0.039135675216969625 0.0333549413137599 0.0007278074085484814)
(-0.03856842104566459 0.033162384469452404 0.0007236058032590157)
(-0.03800286882779754 0.032964884793457 0.0007192963449984466)
(-0.037439061632359494 0.03276245732613869 0.0007148793619487059)
(-0.03687704239545124 0.03255511748313284 0.000710355190480154)
(-0.03631685391701362 0.03234288105417122 0.0007057241751259637)
(-0.035758538857568134 0.03212576420187963 0.0007009866685558844)
(-0.03520213973496815 0.031903783460546974 0.0006961430315493835)
(-0.034647698921161055 0.03167695573486611 0.0006911936329681715)
(-0.034095258638961415 0.03144529829864658 0.0006861388497281133)
(-0.033544860958835576 0.03120882879349903 0.0006809790667705224)
(-0.03299654779569784 0.030967565227491813 0.0006757146770328483)
(-0.032450360905718456 0.030721525973779577 0.0006703460814187516)
(-0.03190634188314374 0.030470729769204057 0.0006648736887675732)
(-0.03136453215712855 0.030215195712867238 0.0006592979158232011)
(-0.030824972988581164 0.029954943264676855 0.0006536191872023326)
(-0.030287705467021298 0.029689992243864427 0.0006478379353621376)
(-0.029752770507450822 0.029420362827476003 0.0006419546005673273)
(-0.029220208847237993 0.029146075548835554 0.0006359696308566247)
(-0.02869006104301513 0.028867151295981296 0.0006298834820086447)
(-0.028162367467590085 0.028583611310074974 0.0006236966175071855)
(-0.027637168306871664 0.028295477183784286 0.0006174095085059325)
(-0.02711450355680936 0.028002770859638516 0.0006110226337925778)
(-0.026594413020347457 0.027705514628357505 0.0006045364797523585)
(-0.026076936304393922 0.027403731127154128 0.0005979515403310168)
(-0.025562112816804164 0.027097443338010403 0.0005912683169971842)
(-0.02504998176337999 0.02678667458592733 0.000584487318704193)
(-0.02454058214488391 0.026471448537148556 0.0005776090618513167)
(-0.02403395275406909 0.026151789197358152 0.000570634070244445)
(-0.023530132172725142 0.02582772090985245 0.0005635628750561935)
(-0.02302915876873996 0.02549926835368623 0.0005563960147854533)
(-0.022531070693177842 0.025166456541793294 0.0005491340352163811)
(-0.02203590587737419 0.02482931081908165 0.0005417774893768374)
(-0.021543702030046817 0.0244878568605034 0.0005343269374962697)
(-0.02105449663442434 0.02414212066909948 0.0005267829469630499)
(-0.020568326945391686 0.023792128574019446 0.0005191460922812648)
(-0.02008522998665295 0.023437907228516366 0.0005114169550269654)
(-0.01960524254791192 0.023079483607917145 0.0005035961238038785)
(-0.019128401182070404 0.02271688500756818 0.0004956841941985814)
(-0.018654742202444598 0.022350139040756743 0.00048768176873514554)
(-0.018184301679999605 0.02197927363660812 0.00047958945682925275)
(-0.017717115440602636 0.021604317037958704 0.0004714078747417853)
(-0.01725321906229458 0.02122529779920518 0.00046313764553189543)
(-0.01679264787258071 0.020842244784130014 0.00045477939900955694)
(-0.01633543694574028 0.020455187163703363 0.0004463337716876029)
(-0.015881621100155556 0.020064154413861564 0.0004378014067332523)
(-0.01543123489566016 0.01966917631326246 0.0004291829539191307)
(-0.01498431263090734 0.01927028294101766 0.0004204790695737882)
(-0.014540888340757875 0.018867504674401805 0.00041169041653171546)
(-0.014100995793688252 0.018460872186539336 0.0004028176640828686)
(-0.013664668489219038 0.01805041644406854 0.00039386148792169883)
(-0.013231939655363775 0.017636168704783343 0.0003848225700956959)
(-0.012802842246098546 0.01721816051525292 0.0003757015989534479)
(-0.012377408938852377 0.016796423708419307 0.000366499269092221)
(-0.012159508228078342 0.0165822932763107 0.0003618269264423468)
(-0.011937903613306239 0.016371998349071475 0.00035723827480644264)
(-0.011712662597448456 0.016165602984573632 0.00035273471193224786)
(-0.011483853791100378 0.015963170052844602 0.00034831760964864115)
(-0.011251546891640936 0.01576476121691639 0.00034398831344776724)
(-0.011015812662002116 0.015570436914042453 0.00033974814207518784)
(-0.010776722909113886 0.015380256337287916 0.0003355983871281787)
(-0.010534350462031076 0.015194277417498778 0.0003315403126622962)
(-0.010288769149748985 0.015012556805655613 0.00032757515480633386)
(-0.010040053778714335 0.014835149855617165 0.0003237041213857861)
(-0.00978828011003851 0.014662110607259 0.00031992839155493255)
(-0.009533524836419966 0.014493491770012428 0.00031624911543765575)
(-0.009275865558782917 0.014329344706808723 0.00031266741377710306)
(-0.00901538076263934 0.01416971941843347 0.00030918437759429703)
(-0.008752149794181503 0.014014664528295827 0.0003058010678557998)
(-0.008486252836112386 0.013864227267617383 0.00030251851515053263)
(-0.008217770883221204 0.013718453461045058 0.0002993377193758483)
(-0.007946785717711666 0.013577387512692482 0.00029625964943295294)
(-0.007673379884290271 0.013441072392614054 0.000293285242931769)
(-0.007397636665022415 0.01330954962371586 0.00029041540590533043)
(-0.007119640053963881 0.013182859269107408 0.0002876510125337963)
(-0.006839474731575407 0.01306103991989798 0.0002849929048781669)
(-0.00655722603892822 0.012944128683441442 0.00028244189262378373)
(-0.006272979951708296 0.012832161172032956 0.00027999875283369165)
(-0.005986823054027361 0.012725171492061153 0.000277664229711938)
(-0.005698842512048509 0.012623192233618984 0.0002754390343768806)
(-0.005409126047434566 0.01252625446057647 0.00027332384464457467)
(-0.005117761910627191 0.012434387701118335 0.0002713193048223028)
(-0.004824838853964965 0.01234761993874944 0.0002694260255123133)
(-0.004530446104648564 0.012265977603770746 0.0002676445834258247)
(-0.004234673337561264 0.012189485565228374 0.0002659755212073537)
(-0.0039376106479531384 0.012118167123338252 0.00026441934726942047)
(-0.0036393485239971587 0.012052044002388664 0.00026297653563768167)
(-0.003339977819225613 0.0119911363441228 0.00026164752580653714)
(-0.0030395897248552354 0.01193546270160339 0.00026043272260525585)
(-0.0027382757420095043 0.011885040033561275 0.00025933249607466103)
(-0.002436127653846476 0.011839883699229583 0.00025834718135441177)
(-0.0021332374976007914 0.0118000074536652 0.00025747707858091704)
(-0.0018296975365482025 0.011765423443558819 0.0002567224527959106)
(-0.0015256002319013065 0.01173614220353493 0.00025608353386571655)
(-0.0012210382146449483 0.011712172652942908 0.00025556051641123056)
(-0.0009161042573199426 0.011693522093140056 0.00025515355974863583)
(-0.0006108912457636599 0.01168019620526756 0.0002548627878408739)
(-0.00030549215081608513 0.011672199048519964 0.00025468828925988486)
(3.5727640770341828e-19 0.011669533058908676 0.0002546301171596267)
(0.00010183071693869447 0.011670421722112438 0.00025464950785971275)
(0.00020363041525455535 0.011673087441028303 0.00025470767405337574)
(0.001597528334248135 0.012570502245668727 0.0002742893347498959)
(0.0031623014145839004 0.013430359074906344 0.00029305147750779606)
(0.004897949656261852 0.01425265792874114 0.00031099410232707583)
(0.006804473059281988 0.015037398807173129 0.0003281172092077356)
(0.00888187162364431 0.0157845817102023 0.00034442079814977507)
(0.011130145349348818 0.016494206637828662 0.00035990486915319454)
(0.01354929423639551 0.0171662735900522 0.00037456942221799353)
(0.01613931828478439 0.01780078256687294 0.0003884144573441727)
(0.018900217494515457 0.018397733568290858 0.00040143997453173153)
(0.021831991865588703 0.018957126594305963 0.0004136459737806702)
(0.024934641398004144 0.019478961644918257 0.00042503245509098876)
(0.028208166091761765 0.019963238720127736 0.00043559941846268714)
(0.03165256594686157 0.020409957819934404 0.00044534686389576536)
(0.03526784096330357 0.020819118944338258 0.00045427479139022344)
(0.03905399114108774 0.021190722093339297 0.00046238320094606124)
(0.04301101648021411 0.021524767266937528 0.00046967209256327906)
(0.04713891698068266 0.021821254465132937 0.0004761414662418765)
(0.05143769264249339 0.02208018368792554 0.0004817913219818539)
) 
polyLine 7 8 
 ( 
(-0.06091729709020649 0.036902303696783274 -0.0008052111310999445)
(-0.060318257357722095 0.036899689876274906 -0.0008051540973335615)
(-0.0597192632444326 0.036891848613802354 -0.0008049830003777549)
(-0.05912036036605885 0.036878780506508106 -0.0008046978532622198)
(-0.05852159433137375 0.03686048654957914 -0.0008042986777020134)
(-0.05792301073872909 0.03683696813617109 -0.0008037855040959001)
(-0.057324655172582936 0.03680822705730221 -0.0008031583715240368)
(-0.056726573200028295 0.03677426550171691 -0.0008024173277449965)
(-0.05612881036732293 0.03673508605571916 -0.0008015624291921328)
(-0.0555314121964209 0.036690691702975446 -0.0008005937409692799)
(-0.054934424181505834 0.03664108582428761 -0.0007995113368457963)
(-0.05433789178552639 0.03658627219733538 -0.0007983152992509472)
(-0.05374186043673411 0.03652625499638865 -0.0007970057192676255)
(-0.053146375525223825 0.03646103879198965 -0.0007955826966254173)
(-0.05255148239947706 0.03639062855060484 -0.0007940463396930064)
(-0.05195722636290856 0.036315029634246716 -0.0007923967654699218)
(-0.05136365267041626 0.036234247800065435 -0.0007906340995776267)
(-0.05077080652493497 0.03614828919991043 -0.0007887584762499531)
(-0.05017873307399397 0.03605716037986192 -0.0007867700383228797)
(-0.049587477406278835 0.03596086827973236 -0.0007846689372236529)
(-0.04899708454819782 0.03585942023253797 -0.0007824553329592559)
(-0.04840759946045285 0.035752823963940354 -0.0007801293941042244)
(-0.04781906703461566 0.03564108759165804 -0.0007776912977878068)
(-0.04723153208970905 0.035524219624848384 -0.0007751412296804775)
(-0.04664503936879383 0.03540222896345955 -0.0007724793839797957)
(-0.04605963353556139 0.0352751248975527 -0.0007697059633956174)
(-0.045475359170932414 0.03514291710659454 -0.0007668211791346575)
(-0.044892260769661886 0.03500561565872023 -0.0007638252508844064)
(-0.044310382736950614 0.03486323100996661 -0.0007607184067964001)
(-0.043729769385063635 0.03471577400347594 -0.0007575008834688438)
(-0.04315046492995561 0.034563255868670185 -0.0007541729259285968)
(-0.04257251348790369 0.03440568822039578 -0.0007507347876125098)
(-0.041995959072147794 0.03424308305803921 -0.0007471867303481272)
(-0.04142084558953891 0.034075452764613136 -0.0007435290243337465)
(-0.04084721683719539 0.03390281010581341 -0.0007397619481178423)
(-0.04027511649916761 0.03372516822904691 -0.000735885788577853)
(-0.039704588143111286 0.03354254066243031 -0.0007319008408983343)
(-0.039135675216969625 0.0333549413137599 -0.0007278074085484814)
(-0.03856842104566459 0.033162384469452404 -0.0007236058032590157)
(-0.03800286882779754 0.032964884793457 -0.0007192963449984466)
(-0.037439061632359494 0.03276245732613869 -0.0007148793619487059)
(-0.03687704239545124 0.03255511748313284 -0.000710355190480154)
(-0.03631685391701362 0.03234288105417122 -0.0007057241751259637)
(-0.035758538857568134 0.03212576420187963 -0.0007009866685558844)
(-0.03520213973496815 0.031903783460546974 -0.0006961430315493835)
(-0.034647698921161055 0.03167695573486611 -0.0006911936329681715)
(-0.034095258638961415 0.03144529829864658 -0.0006861388497281133)
(-0.033544860958835576 0.03120882879349903 -0.0006809790667705224)
(-0.03299654779569784 0.030967565227491813 -0.0006757146770328483)
(-0.032450360905718456 0.030721525973779577 -0.0006703460814187516)
(-0.03190634188314374 0.030470729769204057 -0.0006648736887675732)
(-0.03136453215712855 0.030215195712867238 -0.0006592979158232011)
(-0.030824972988581164 0.029954943264676855 -0.0006536191872023326)
(-0.030287705467021298 0.029689992243864427 -0.0006478379353621376)
(-0.029752770507450822 0.029420362827476003 -0.0006419546005673273)
(-0.029220208847237993 0.029146075548835554 -0.0006359696308566247)
(-0.02869006104301513 0.028867151295981296 -0.0006298834820086447)
(-0.028162367467590085 0.028583611310074974 -0.0006236966175071855)
(-0.027637168306871664 0.028295477183784286 -0.0006174095085059325)
(-0.02711450355680936 0.028002770859638516 -0.0006110226337925778)
(-0.026594413020347457 0.027705514628357505 -0.0006045364797523585)
(-0.026076936304393922 0.027403731127154128 -0.0005979515403310168)
(-0.025562112816804164 0.027097443338010403 -0.0005912683169971842)
(-0.02504998176337999 0.02678667458592733 -0.000584487318704193)
(-0.02454058214488391 0.026471448537148556 -0.0005776090618513167)
(-0.02403395275406909 0.026151789197358152 -0.000570634070244445)
(-0.023530132172725142 0.02582772090985245 -0.0005635628750561935)
(-0.02302915876873996 0.02549926835368623 -0.0005563960147854533)
(-0.022531070693177842 0.025166456541793294 -0.0005491340352163811)
(-0.02203590587737419 0.02482931081908165 -0.0005417774893768374)
(-0.021543702030046817 0.0244878568605034 -0.0005343269374962697)
(-0.02105449663442434 0.02414212066909948 -0.0005267829469630499)
(-0.020568326945391686 0.023792128574019446 -0.0005191460922812648)
(-0.02008522998665295 0.023437907228516366 -0.0005114169550269654)
(-0.01960524254791192 0.023079483607917145 -0.0005035961238038785)
(-0.019128401182070404 0.02271688500756818 -0.0004956841941985814)
(-0.018654742202444598 0.022350139040756743 -0.00048768176873514554)
(-0.018184301679999605 0.02197927363660812 -0.00047958945682925275)
(-0.017717115440602636 0.021604317037958704 -0.0004714078747417853)
(-0.01725321906229458 0.02122529779920518 -0.00046313764553189543)
(-0.01679264787258071 0.020842244784130014 -0.00045477939900955694)
(-0.01633543694574028 0.020455187163703363 -0.0004463337716876029)
(-0.015881621100155556 0.020064154413861564 -0.0004378014067332523)
(-0.01543123489566016 0.01966917631326246 -0.0004291829539191307)
(-0.01498431263090734 0.01927028294101766 -0.0004204790695737882)
(-0.014540888340757875 0.018867504674401805 -0.00041169041653171546)
(-0.014100995793688252 0.018460872186539336 -0.0004028176640828686)
(-0.013664668489219038 0.01805041644406854 -0.00039386148792169883)
(-0.013231939655363775 0.017636168704783343 -0.0003848225700956959)
(-0.012802842246098546 0.01721816051525292 -0.0003757015989534479)
(-0.012377408938852377 0.016796423708419307 -0.000366499269092221)
(-0.012159508228078342 0.0165822932763107 -0.0003618269264423468)
(-0.011937903613306239 0.016371998349071475 -0.00035723827480644264)
(-0.011712662597448456 0.016165602984573632 -0.00035273471193224786)
(-0.011483853791100378 0.015963170052844602 -0.00034831760964864115)
(-0.011251546891640936 0.01576476121691639 -0.00034398831344776724)
(-0.011015812662002116 0.015570436914042453 -0.00033974814207518784)
(-0.010776722909113886 0.015380256337287916 -0.0003355983871281787)
(-0.010534350462031076 0.015194277417498778 -0.0003315403126622962)
(-0.010288769149748985 0.015012556805655613 -0.00032757515480633386)
(-0.010040053778714335 0.014835149855617165 -0.0003237041213857861)
(-0.00978828011003851 0.014662110607259 -0.00031992839155493255)
(-0.009533524836419966 0.014493491770012428 -0.00031624911543765575)
(-0.009275865558782917 0.014329344706808723 -0.00031266741377710306)
(-0.00901538076263934 0.01416971941843347 -0.00030918437759429703)
(-0.008752149794181503 0.014014664528295827 -0.0003058010678557998)
(-0.008486252836112386 0.013864227267617383 -0.00030251851515053263)
(-0.008217770883221204 0.013718453461045058 -0.0002993377193758483)
(-0.007946785717711666 0.013577387512692482 -0.00029625964943295294)
(-0.007673379884290271 0.013441072392614054 -0.000293285242931769)
(-0.007397636665022415 0.01330954962371586 -0.00029041540590533043)
(-0.007119640053963881 0.013182859269107408 -0.0002876510125337963)
(-0.006839474731575407 0.01306103991989798 -0.0002849929048781669)
(-0.00655722603892822 0.012944128683441442 -0.00028244189262378373)
(-0.006272979951708296 0.012832161172032956 -0.00027999875283369165)
(-0.005986823054027361 0.012725171492061153 -0.000277664229711938)
(-0.005698842512048509 0.012623192233618984 -0.0002754390343768806)
(-0.005409126047434566 0.01252625446057647 -0.00027332384464457467)
(-0.005117761910627191 0.012434387701118335 -0.0002713193048223028)
(-0.004824838853964965 0.01234761993874944 -0.0002694260255123133)
(-0.004530446104648564 0.012265977603770746 -0.0002676445834258247)
(-0.004234673337561264 0.012189485565228374 -0.0002659755212073537)
(-0.0039376106479531384 0.012118167123338252 -0.00026441934726942047)
(-0.0036393485239971587 0.012052044002388664 -0.00026297653563768167)
(-0.003339977819225613 0.0119911363441228 -0.00026164752580653714)
(-0.0030395897248552354 0.01193546270160339 -0.00026043272260525585)
(-0.0027382757420095043 0.011885040033561275 -0.00025933249607466103)
(-0.002436127653846476 0.011839883699229583 -0.00025834718135441177)
(-0.0021332374976007914 0.0118000074536652 -0.00025747707858091704)
(-0.0018296975365482025 0.011765423443558819 -0.0002567224527959106)
(-0.0015256002319013065 0.01173614220353493 -0.00025608353386571655)
(-0.0012210382146449483 0.011712172652942908 -0.00025556051641123056)
(-0.0009161042573199426 0.011693522093140056 -0.00025515355974863583)
(-0.0006108912457636599 0.01168019620526756 -0.0002548627878408739)
(-0.00030549215081608513 0.011672199048519964 -0.00025468828925988486)
(3.5727640770341828e-19 0.011669533058908676 -0.0002546301171596267)
(0.00010183071693869447 0.011670421722112438 -0.00025464950785971275)
(0.00020363041525455535 0.011673087441028303 -0.00025470767405337574)
(0.001597528334248135 0.012570502245668727 -0.0002742893347498959)
(0.0031623014145839004 0.013430359074906344 -0.00029305147750779606)
(0.004897949656261852 0.01425265792874114 -0.00031099410232707583)
(0.006804473059281988 0.015037398807173129 -0.0003281172092077356)
(0.00888187162364431 0.0157845817102023 -0.00034442079814977507)
(0.011130145349348818 0.016494206637828662 -0.00035990486915319454)
(0.01354929423639551 0.0171662735900522 -0.00037456942221799353)
(0.01613931828478439 0.01780078256687294 -0.0003884144573441727)
(0.018900217494515457 0.018397733568290858 -0.00040143997453173153)
(0.021831991865588703 0.018957126594305963 -0.0004136459737806702)
(0.024934641398004144 0.019478961644918257 -0.00042503245509098876)
(0.028208166091761765 0.019963238720127736 -0.00043559941846268714)
(0.03165256594686157 0.020409957819934404 -0.00044534686389576536)
(0.03526784096330357 0.020819118944338258 -0.00045427479139022344)
(0.03905399114108774 0.021190722093339297 -0.00046238320094606124)
(0.04301101648021411 0.021524767266937528 -0.00046967209256327906)
(0.04713891698068266 0.021821254465132937 -0.0004761414662418765)
(0.05143769264249339 0.02208018368792554 -0.0004817913219818539)
) 
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 6 0)
        );
    }
    outlet-1
    {
        type patch;
        faces
        (
            (10 13 9 10)
 (12 9 13 15)
        );
    }
    outlet-2
    {
        type patch;
        faces
        (
             (11 12 15 14)
        );
    }
    nozzle
    {
        type wall;
        faces
        (
            (1 2 7 6)
 (2 3 8 7)
 (3 11 14 8)
 );
    }
    wedge1
    {
        type wedge;
        faces
        (
            (0 5 2 1)
 (5 4 3 2)
 (4 10 9 3)
 (3 9 12 11)
 );
    }
    wedge2
    {
        type wedge;
        faces
        (
            (0 6 7 5)
 (5 7 8 4)
 (4 8 13 10)
 (8 14 15 13)
   );
    }
);
 
 // ************************************************************************* //