HRE_nozzle_wedge_20Bar/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

points  (
			(-0.1	0	0) //Chamber
			(0	0	0) //Throat
			(0.0304	0	0) //Exit
			(0.06	0	0) //Point1 Exhaust Plume
			(0.2	0	0) //Point2 Exhaust Plume
			(0.4	0	0) //Point3 Exhaust Plume
		);

fields  (p	U	T);

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

// ************************************************************************* //
